In [1]:
import pandas as pd
import numpy as np
from sklearn.model_selection import train_test_split
from sklearn import tree
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score, confusion_matrix

In [15]:
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
df=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
df.dtypes

Survived      int64
Pclass        int64
Sex          object
Age         float64
Fare        float64
dtype: object

In [5]:
target=df.Survived
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [20]:
df1=df.drop('Survived',axis='columns')
df1.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [9]:
from sklearn.preprocessing import LabelEncoder

In [10]:
le_Sex=LabelEncoder()

In [22]:
df1['Sex_n']=le_Sex.fit_transform(df1['Sex'])
df1.head()

   Pclass     Sex   Age     Fare  Sex_n
0       3    male  22.0   7.2500      1
1       1  female  38.0  71.2833      0
2       3  female  26.0   7.9250      0
3       1  female  35.0  53.1000      0
4       3    male  35.0   8.0500      1

In [23]:
df1=df1.drop('Sex',axis='columns')
df1.head()

   Pclass   Age     Fare  Sex_n
0       3  22.0   7.2500      1
1       1  38.0  71.2833      0
2       3  26.0   7.9250      0
3       1  35.0  53.1000      0
4       3  35.0   8.0500      1

In [37]:
df1.corr()

          Pclass       Age      Fare     Sex_n
Pclass  1.000000 -0.331339 -0.549500  0.131900
Age    -0.331339  1.000000  0.091566  0.084153
Fare   -0.549500  0.091566  1.000000 -0.182333
Sex_n   0.131900  0.084153 -0.182333  1.000000

In [26]:
df1.groupby('Sex_n').size()

Sex_n
0    314
1    577
dtype: int64

In [27]:
df1.groupby('Pclass').size()

Pclass
1    216
2    184
3    491
dtype: int64

In [36]:
df1.skew()

Pclass   -0.630548
Age       0.434488
Fare      4.787317
Sex_n    -0.618921
dtype: float64

In [29]:
df1.describe()

           Pclass         Age        Fare       Sex_n
count  891.000000  714.000000  891.000000  891.000000
mean     2.308642   29.699118   32.204208    0.647587
std      0.836071   14.526497   49.693429    0.477990
min      1.000000    0.420000    0.000000    0.000000
25%      2.000000   20.125000    7.910400    0.000000
50%      3.000000   28.000000   14.454200    1.000000
75%      3.000000   38.000000   31.000000    1.000000
max      3.000000   80.000000  512.329200    1.000000

In [30]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
Pclass    891 non-null int64
Age       714 non-null float64
Fare      891 non-null float64
Sex_n     891 non-null int32
dtypes: float64(2), int32(1), int64(1)
memory usage: 24.5 KB

In [34]:
df1.Age=df1.Age.fillna(df1.Age.mean())

In [35]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
Pclass    891 non-null int64
Age       891 non-null float64
Fare      891 non-null float64
Sex_n     891 non-null int32
dtypes: float64(2), int32(1), int64(1)
memory usage: 24.5 KB

In [38]:
X_train,X_test, y_train,y_test=train_test_split(df1,target, test_size=0.3,random_state=100)

In [40]:
model_gin=DecisionTreeClassifier(criterion='gini', min_samples_leaf=5,random_state=100)
model_c=DecisionTreeClassifier(criterion='entropy',min_samples_leaf=5,random_state=100)

In [48]:
model_gin.fit(X_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=5, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=100, splitter='best')

In [49]:
model_gin.score(X_test,y_test)

0.7761194029850746

In [50]:
pred=model_gin.predict(X_test)

In [51]:
accuracy_score(pred,y_test)

0.7761194029850746

In [52]:
model_c.fit(X_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='entropy', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=5, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=100, splitter='best')

In [53]:
model_c.score(X_test,y_test)

0.8097014925373134

In [54]:

predi=model_c.predict(X_test)
accuracy_score(predi,y_test)

0.8097014925373134

In [55]:
confusion_matrix(predi,y_test)

array([[139,  31],
       [ 20,  78]], dtype=int64)